import { useState } from "react";
import Paper from "@mui/material/Paper";
import Typography from "@mui/material/Typography";
import Tabs from "@mui/material/Tabs";
import Tab from "@mui/material/Tab";
import FormControl from "@mui/material/FormControl";
import RadioGroup from "@mui/material/RadioGroup";
import Radio from "@mui/material/Radio";
import FormControlLabel from "@mui/material/FormControlLabel";

//components
import Container from "@mui/material/Container";

export default function Track() {
  let [tab, setTab] = useState("one");
  return (
    <Container
      sx={{
        display: "flex",
        flexDirection: "column",
        my: 3,
      }}
      maxWidth={"xs"}
    >
      <Typography variant="h6" component="h3" sx={{ my: 2 }}>
        اختيار المسار
      </Typography>
      <Typography>البرنامج مكون من ثلاث مسارات اساسية</Typography>

      <Tabs
        value={tab}
        onChange={(e, value) => setTab(value)}
        aria-label="secondary tabs example"
        sx={{
          mt: 3,
        }}
      >
        <Tab value="one" label="المسار التأهيلي" />
        <Tab value="two" label="الحافظين الجدد" />
        <Tab value="three" label="الخاتمين" />
      </Tabs>

      {tab == "one" && (
        <Paper
          sx={{
            p: 2,
            my: 2,
            backgroundColor: "skyblue",
          }}
          variant="outlined"
        >
          <Typography>💠 المسار التأهيلي</Typography>
          <Typography variant="body1">
            📀 هو مخصص للطلاب المبتدئين في القراءة والغرض منه تعريف الطالب
            بالأحكام العامة للتجويد حيث يتم تدريبهم وتأهيلهم لقراءة القرآن
            الكريم مجوداً مع شرح دروس التجويد
          </Typography>
          <Typography>📀 يتم قبول الطلاب مباشرة في هذا المسار</Typography>
          <Typography>📀 تتراوح مدته من ثلاثة إلى أربعة أشهر</Typography>
        </Paper>
      )}

      {tab == "two" && (
        <Paper
          sx={{
            p: 2,
            my: 2,
            backgroundColor: "#4caf50",
          }}
          variant="outlined"
        >
          <Typography>💠 مسار الحافظ الجديد</Typography>
          <Typography variant="body1">
            📀 هو مخصص للطلاب الذين يرغبون في حفظ كتاب الله كاملاً
          </Typography>
          <Typography>
            📀 يخضع جميع طلاب هذا المسار لإختبار تمهيدي يتم من خلاله التأكد من
            جودة القراءة والمخارج الصحيحة وإذا اجتاز الطالب هذا الاختبار يحق له
            الدخول في المسار مباشرة وإذا لم يجتاز الاختبار يتم تحويله إلى مسار
            التأهيل
          </Typography>
          <Typography>
            📀 يسمح لهم بمقدار يومي من الحفظ (نصف وجه، وجه، وجهين)
          </Typography>
        </Paper>
      )}

      {tab == "three" && (
        <Paper
          sx={{
            p: 2,
            my: 2,
            backgroundColor: "#ba68c8",
          }}
          variant="outlined"
        >
          <Typography>💠 مسار الخاتم</Typography>
          <Typography variant="body1">
            📀 هو مخصص للطلاب الحافظين للقرآن كاملاً ويرغبون بتجويد حفظهم
            واتقانه أو الطلاب الذين تفلت منهم القرآن لضعف التعاهد او الانشغال عن
            المراجعة المنتظمة الصحيحة
          </Typography>
          <Typography>
            📀 يتم قبول الطلاب مباشرة في المسار بعد التأكد من صحة البيانات
          </Typography>
          <Typography>
            📀 يسمح لهم بمقدار يومي من الحفظ (وجه، وجهين، ثلاثة أوجه، أربعة
            أوجه)
          </Typography>
        </Paper>
      )}

      <FormControl>
        <RadioGroup
          aria-labelledby="demo-radio-buttons-group-label"
          defaultValue="1"
          name="radio-buttons-group"
          row
        >
          <FormControlLabel value="1" control={<Radio />} label="المسار التمهيدي" />
          <FormControlLabel
            value="2"
            disabled
            control={<Radio />}
            label="الحافظين الجدد"
          />
          <FormControlLabel
            value="3"
            disabled
            control={<Radio />}
            label="الخاتمين"
          />
        </RadioGroup>
      </FormControl>
    </Container>
  );
}

// ‏﷽
// #مَقَــارِئُ_الحُفّاظِ

//  برنامج السفرة
// هو برنامج يهتم بتعليم القرآن الكريم وعلومه ويعتمد على منهج مجرب تدريسه يقوم على آلية معينة للحفظ (بمنهجية مقارئ الحفاظ)

// #مشروع_تعليم_القرآن_الكريم_عن_بعد_في_السودان (الأونلاين):
// ▪️ حقيقةً بدأ هذا المشروع بفكرة بسيطة جدّاً، مكنونها تحويل هذه الأسافير و وسائط التواصل الإجتماعي إلى منبر لنشر كتاب الله و تحفيظه (خلوة إلكترونية)، استعنّا بالله و بدأنا هذا المشروع بغير تخطيط مؤسس و لم نظُن مجرد الظن أن هذا المشروع القرآني سيجد كل هذا الإحتفاف و الإقبال عليه من كل حدبٍ و صوب، لا نجد في الذاكرة تاريخ معين لبداية المشروع، و لكن يمكن القول بأن الإنطلاقة الحقيقية لهذه التجارة الرابحة كانت في عهد "الكورونا" ومنها انطلق بصورة لا يمكن وصفها كما النار في الهشيم..
// ▪️ ولله الفضل و المنّة، نتائج كبيرة وجبارة على مستوى الدول وبالأخص في المملكة ومصر وعمان وعدد من الدول الأخرى.
// ▪️ بمجهودات من المشايخ في المملكة والسودان نقلنا التجربة إلى السودان في سبتمبر ٢٠٢١ واعتمدنا فقط على وسائل التواصل الاجتماعي، تمت مضاعفة الجهود من جميع الأعضاء في البرنامج ثم ازداد عدد المشتركين تدريجياً في الدورات السابقة
// ▪️وفي  دورة (ذو القعدة ١٤٤٤ ﮪ) ضاعف أهل الخير جهودهم ونشروا البرنامج في كل فج عميق ووصل عدد المشتركين في هذه الدورة إلى أكثر من ٢٥٠ طالب في فترة وجيزة جدًا، اضطررنا بعدها لإغلاق باب الإشتراك إلى حين الدورات القادمة بإذنه تعالى...

// #أهداف_البرنامج :
// ١- إعانة الطالب على حفظ القرآن الكريم كاملاً وإتقانه وفق خطط معينة ومدروسة
// ٢- توفير الوقت والجهد والمال من خلال التواصل عبر المنصة الإلكترونية الموحدة او المجموعات الخاصة (واتساب)
// ٣-  مواكبة العلم وتغيير نظام التدريس التقليدي إلى نظام متطور يعتمد على التقنية الحديثة وربطه بها
// ٤- استثمار أوقات المشتركين واستغلال أوقات الفراغ (فإذا فرغت فانصب)
// ٥- تنوير المجتمع بدور المقاريء في التعليم عن بعد ومدى نجاحه

//  #رؤيا_البرنامج:
// تخريج خاتم متقن بالإسناد وتعلم القراءات

// #تحديات_البرنامج
// ١- توسعة باب الإشتراك في البرنامج عبر زيادة المسارات وزيادة عدد الطلاب والمعلمين تدريجياً وتفعيل جميع مراحل البرنامج
// ٢- فتح قسم خاص بالنساء والأطفال
// ٣- تنظيم المنافسات والمسابقات بين الطلاب المشتركين في البرنامج فيما بينهم والبرامج الأخرى
// ٤- تقديم الجوائز والشهادات التقديرية للطلاب المتميزين وتحفيزهم وتشجيع الآخرين للانضمام في البرنامج
// ٥- دعم الطلاب المحتاجين بتوفير الأدوات اللازمة للاشتراك في البرنامج (مثل توفير المصاحف والاشتراك في خدمة الإنترنت)
// ٦- مكافأة المعلمين تقديراً وعرفاناً لجهودهم المباركة ودورهم في المنظومة التعليمية وتخصيص جزء من وقتهم الخاص لذلك
// ٧- تأهيل الخاتمين وتشجيعهم على الإنضمام في البرنامج لتوسعة الإشتراك
// ٨- المشاريع الأخرى المستقبلية

// #الإشتراك_في_البرنامج
// ١/ متاح للبالغين  (للذكور حاليا)
// ٢/ يكون الإشتراك في البرنامج متاحا على فترتين خلال السنة يتم الإعلان عنها عبر مواقع التواصل الاجتماعي.
// ٣/ يتم فتح الإشتراك في فترات غير الفترات الرئيسية في السنة لتدعيم  المجموعات الناقصة
// ٤/ الإشتراك متاح مجاناً  لكل مشترك وما زلنا على هذا العهد ماضون وسنمضي على هذا النهج إن شاء اللهُ تعالى

// #للبرنامج_ثلاثة_مسارات_نشطة

// 💠

// 💠 مسار الحافظ الجديد
// 📀 هو مخصص للطلاب الذين يرغبون في حفظ كتاب الله كاملاً
// 📀 يخضع جميع طلاب هذا المسار لإختبار تمهيدي يتم من خلاله التأكد من جودة القراءة والمخارج الصحيحة وإذا اجتاز الطالب هذا الاختبار يحق له الدخول في المسار مباشرة وإذا لم يجتاز الاختبار يتم تحويله إلى مسار التأهيل
// 📀 يسمح لهم بمقدار يومي من الحفظ (نصف وجه، وجه، وجهين)

// 💠 مسار الخاتم
// 📀 هو مخصص للطلاب الحافظين للقرآن كاملاً  ويرغبون بتجويد حفظهم واتقانه أو الطلاب الذين تفلت منهم القرآن لضعف التعاهد او الانشغال عن المراجعة المنتظمة الصحيحة
// 📀 يتم قبول الطلاب مباشرة في المسار بعد التأكد من صحة البيانات
// 📀 يسمح لهم بمقدار يومي من الحفظ (وجه، وجهين، ثلاثة أوجه، أربعة أوجه)

// 💠⛔ مسار الخمسة أجزاء
// سيكون متاحا ان شاء الله لاحقاً ليساعد الطالب على حفظ أجزاء  معينة من القرآن
// 💠 ⛔مسار السور
// سيكون متاحا ان شاء الله لاحقاً ليساعد الطالب على حفظ سور محددة كالبقرة وآل عمران والرحمن وغيرهم

// #مراحل_البرنامج
// ▪️الضبط ✅
// ▪️التعاهد ✅
// ▪️الإسناد ⛔
// ▪️القراءات ⛔
